# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l-Rail: 钢轨缺陷检测专用，添加RailSPPCSPC模块

# Parameters
nc: 1 # number of classes
scales:
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, HGStem, [32, 48]] # 0-P2/4
  - [-1, 6, HGBlock, [48, 128, 3]] # stage 1

  - [-1, 1, DWConv, [128, 3, 2, 1, False]] # 2-P3/8
  - [-1, 6, HGBlock, [96, 512, 3]] # stage 2

  - [-1, 1, DWConv, [512, 3, 2, 1, False]] # 4-P4/16
  - [-1, 6, HGBlock_DyT, [192, 1024, 5, True, False]] # cm, c2, k, light, shortcut
  - [-1, 6, HGBlock_DyT, [192, 1024, 5, True, True]]
  - [-1, 6, HGBlock_DyT, [192, 1024, 5, True, True]] # stage 3 (7)

  # ===== 添加RailSPPCSPC模块 =====
  # 位置：Stage 3之后，增强P4特征的多尺度表达能力
  # 适配钢轨长条形缺陷，使用非对称条形池化
  - [-1, 1, RailSPPCSPC, [1024, 1024, 1, False, 1, 0.5, [5, 9, 13]]] # 8-P4/16
  # 参数说明: [c1, c2, n, shortcut, g, e, k]
  # c1=1024(输入), c2=1024(输出保持), k=(5,9,13)内部会转为条形池化

  - [-1, 1, DWConv, [1024, 3, 2, 1, False]] # 9-P5/32
  - [-1, 6, HGBlock, [384, 2048, 5, True, False]] # stage 4
  - [-1, 1, RailSimAM_Lite, [2048]] # stage 4

head:
  # 注意：后续层号因插入RailSPPCSPC而改变，需要更新from索引
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 12 input_proj.2 (原10)
  - [-1, 1, AIFI, [1024, 8]] # 13
  - [-1, 1, Conv, [256, 1, 1]] # 14, Y5, lateral_convs.0 (原12)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [8, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 16 input_proj.1 (原14, from改为8即RailSPPCSPC输出)
  - [[-2, -1], 1, Concat, [1]] # 17
  - [-1, 3, RepC3, [256]] # 18, fpn_blocks.0 (原16)
  - [-1, 1, Conv, [256, 1, 1]] # 19, Y4, lateral_convs.1 (原17)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 20
  - [3, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 21 input_proj.0 (原19)
  - [[-2, -1], 1, Concat, [1]] # 22 cat backbone P3
  - [-1, 3, RepC3, [256]] # X3 (23), fpn_blocks.1 (原21)

  - [-1, 1, Conv, [256, 3, 2]] # 24, downsample_convs.0 (原22)
  - [[-1, 19], 1, Concat, [1]] # 25 cat Y4
  - [-1, 3, RepC3, [256]] # F4 (26), pan_blocks.0 (原24)

  - [-1, 1, Conv, [256, 3, 2]] # 27, downsample_convs.1 (原25)
  - [[-1, 14], 1, Concat, [1]] # 28 cat Y5
  - [-1, 3, RepC3, [256]] # F5 (29), pan_blocks.1 (原27)

  - [[23, 26, 29], 1, RTDETRDecoder, [nc]] # Detect(P3, P4, P5)