# Ultralytics YOLO 🚀, AGPL-3.0 license
# Modified RT-DETR-l with RailSimAM_Lite for Rail Defect Detection

# Parameters
nc: 1  # number of classes
scales: 
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, vanillanet_5, []]  # 4

head:
  # --- 原有 Neck 结构保持不变，用于特征融合 ---
  
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 5 input_proj.2
  - [-1, 1, SPPELAN, [1024, 256]]
  - [-1, 1, Conv, [256, 1, 1]]  # 7, Y5, lateral_convs.0

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 8
  - [3, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 9 input_proj.1
  - [[-2, -1], 1, Concat, [1]] # 10
  - [-1, 3, RepC3, [256]]  # 11, fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]]   # 12, Y4, lateral_convs.1

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 13
  - [2, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 14 input_proj.0
  - [[-2, -1], 1, Concat, [1]]  # 15 cat backbone P4
  - [-1, 3, RepC3, [256]]    # X3 (16), fpn_blocks.1

  - [-1, 1, Conv, [256, 3, 2]]   # 17, downsample_convs.0
  - [[-1, 12], 1, Concat, [1]]  # 18 cat Y4
  - [-1, 3, RepC3, [256]]    # F4 (19), pan_blocks.0

  - [-1, 1, Conv, [256, 3, 2]]   # 20, downsample_convs.1
  - [[-1, 7], 1, Concat, [1]]  # 21 cat Y5
  - [-1, 3, RepC3, [256]]    # F5 (22), pan_blocks.1
  
  # --- 新增：RailSimAM_Lite 模块 ---
  # 作用：对融合后的多尺度特征进行筛选，强化钢轨纵向特征
  # 注意：这里的 from=-1 表示取上一层（F5）的输出
  # 如果你希望对所有层级都加，需要分别在 P3/P4/P5 处理，但通常在输入解码器前加一次即可
  - [-1, 1, RailSimAM_Lite, [256]] # 23 (示例索引), out_channels 默认为 None 即 256
  
  # --- 检测头 ---
  # 最后将增强后的特征送入 RT-DETR 解码器
  - [[16, 19, 23], 1, RTDETRDecoder, [nc]]  # 注意：这里 from 索引已更新，最后一个输入改为 RailSimAM_Lite 的输出 (23)